dataaa = [
                    ("Математический анализ", "ИС", 72, 36, 0, "Экзамен"),
                    ("Линейная алгебра", "ИС", 36, 18, 0, "Зачет"),
                    ("Программирование на Python", "ИС", 36, 72, 0, "Диф. зачет"),
                    ("Базы данных", "ИС", 36, 36, 18, "Экзамен"),
                    ("Физика", "ИС", 72, 36, 18, "Экзамен"),
                    ("История", "ИС", 36, 0, 0, "Зачет"),
                    ("Иностранный язык", "ИС", 36, 36, 0, "Зачет"),
                    ("Философия", "ИС", 36, 0, 0, "Зачет"),
                    ("Сети ЭВМ", "ИС", 36, 18, 18, "Экзамен"),
                    ("Защита информации", "ИС", 36, 18, 18, "Диф. зачет")
                ]